Repository: evahteev/sol-atlas
Catalog: bot/luka_bot/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: kb_scope_selection_limit
ru: Можно выбрать не более 10 баз знаний.

source: kb_scope_saved_custom_toast
ru: Сохранено.

source: kb_scope_saved_custom_message
ru: Буду ориентироваться на: {group_summary}

source: kb_scope_selection_cancelled
ru: Выбор отменён.

source: twitter.error_invalid_handle
ru: ❌ Некорректный хэндл или URL Twitter. Пожалуйста, предоставьте действительную ссылку на профиль Twitter/X или хэндл.

source: twitter.error_generic
ru: ❌ Не удалось получить информацию об аккаунте Twitter: {error}

source: twitter.account_info_header
ru: 🐦 Информация об аккаунте Twitter

source: twitter.display_name
ru: Отображаемое имя:

source: twitter.handle
ru: Хэндл:

source: twitter.bio
ru: Описание:

source: twitter.stats_header
ru: Статистика аккаунта

source: twitter.followers
ru: Подписчиков:

source: twitter.following
ru: Подписок:

source: twitter.tweets
ru: Твитов:

source: twitter.created
ru: Создан:

source: twitter.usefulness_score_header
ru: Анализ качества контента

source: twitter.usefulness_score
ru: Оценка полезности:

source: twitter.phase1_notice
ru: ⚠️ Фаза 1: Это тестовые данные. Полная интеграция Twitter API будет добавлена в Фазе 2.

source: twitter.actions_header
ru: 📋 Доступные действия:

source: twitter.action_add_kb
ru: • Попросите меня добавить этот аккаунт в базу знаний

source: twitter.action_analyze_tweets
ru: • Запросите анализ последних твитов

source: twitter.action_monitor
ru: • Настройте мониторинг этого аккаунта

source: kb_gathering.button_yes
ru: ✅ Да, добавить в БЗ

source: kb_gathering.button_no
ru: ❌ Нет, пропустить

source: kb_gathering.prompt_header
ru: 📚 Добавить в базу знаний?

source: kb_gathering.prompt_score
ru: **Оценка полезности:** {score}/10

source: kb_gathering.prompt_potential_reward
ru: **Потенциальная награда:** {reward} токенов Atlas

source: kb_gathering.prompt_question
ru: Хотите отправить это на модерацию и добавить в базу знаний?

source: kb_gathering.confirmed_submission
ru: ✅ Контент отправлен на проверку! ID заявки: #{submission_id}

source: kb_gathering.cancelled
ru: ❌ Отправка отменена.

source: kb_gathering.analyzing_content
ru: 🔍 Анализирую контент...
